{
  "theme": "dark",
  "portfolio": {
    "firstname": "Jessish",
    "secondname": "Pothancheri",
    "navBarTitle1": "Development Lead | Equities Front Office",
    "navBarTitle2": "Order Management | Investment Bank",
    "email": "jessish.pothancheri@gmail.com",
    "linkedin": "https://www.linkedin.com/in/jessish-pothancheri-5985576/",
    "github": "https://github.com/jpothanc",
    "webCounterUrl-local": "http://localhost:8007/api/v1/command/incrementCounter?siteName=test",
    "webCounterUrl": "https://data-store.azurewebsites.net/api/v1/command/incrementCounter?siteName=jpothanc_profile",
    "devTooltip": "This site was developed using React(TS), Tailwind, Framer motion and Azure. © 2023 Jessish Pothancheri. All Rights Reserved.",
    "resumeFileName": "jessish.pothancheri-resume.pdf",
    "intro": "Equities Front Office Solutions Technical and Delivery Lead with 20+ years of experience in designing, implementing and optimizing technology solutions for an investment bank. My expertise lies in understanding the unique challenges of the equities front office environment and delivering innovative solutions that drive revenue generation, lead high-performing teams, optimise trading processes, reduce operational risk, and improve the overall client experience.",
    "readmeUrl": "https://api.github.com/repos/jpothanc/jpothanc.github.io/readme",
    "experiance": [
      {
        "title": "Vice President",
        "location": "Credit Suisse, Singapore",
        "description": "Technical and Delivery lead for APAC Front Office Systems.",
        "icon": "CgWorkAlt",
        "date": "2014 - 2023"
      },
      {
        "title": "Assistant Vice President",
        "location": "Credit Suisse, Singapore",
        "description": "Lead APAC OMS and platform migration.",
        "icon": "CgWorkAlt",
        "date": "2009 - 2014"
      },
      {
        "title": "ENO",
        "location": "Credit Suisse, Singapore",
        "description": "Equities IT Developer and Lead APAC OMS.",
        "icon": "CgWorkAlt",
        "date": "2005 - 2009"
      },
      {
        "title": "Software Consultant",
        "location": "Optimum Solutions, Singapore",
        "description": "Worked for Credit Suisse as a Software Consultant in Equities IT.",
        "icon": "CgWorkAlt",
        "date": "2004 - 2005"
      },
      {
        "title": "Software Engineer",
        "location": "Enventure Technologies, Bangalore",
        "description": "Provided Software services for Cadence Design Systems in Electronic Design Automation domain.",
        "icon": "CgWorkAlt",
        "date": "2000 - 2004"
      }
    ],
    "expertise": [
      "In-depth understanding of equities front office functions, including sales and trading, program trading and electronic trading.",
      "Proven ability to lead cross-functional teams and foster collaboration, innovation, and a growth mindset in fast-paced trading environments.",
      "Strong collaboration skills, with a history of successfully partnering with trading desks, operations, compliance, and technology teams.",
      "Strong track record of delivering complex projects on time using Agile/Scrum and other project management methodologies.",
      "As a proactive leader, I am dedicated to fostering a positive team culture, focused on continuous improvement, innovation, and collaboration.",
      "Strong leadership and communication skills to effectively mentor and manage a team of developers, collaborate with stakeholders, and contribute to the overall success of the organization.",
      "Strong work ethic with innovation and collaboration.",
      "Exceptional production environment ownership.",
      "Consistentantly recognised as a top performer througout the 19+ years with Credit Suisse, showcasing exceptional skills and dedication. ",
      "Led and successfully oversaw the multi-year migration of an equities Order Entry platform in the APAC region.",
      "Winner of Hackathon and proven history of successfully transforming event ideas into products that delivered tangible benefits to business.",
      "Well-versed in design patterns, SOLID principles, and software architecture best practices to ensure maintainable and scalable code.",
      "Track record of identifying process inefficiencies and delivering innovative solutions."
    ],
    "currentresponsiblities": [
      "Lead Order Management, Program Tradinag and IOI teams and provide guidance on technical design, development, and maintenance of applications.",
      "Collaborate with Business stakeholders and COO's to identify and prioritize application requirements and enhancements.",
      "Collaborate with other teams such as Support, compliance, operations, and IT to resolve system issues or incidents.",
      "Actively contributing to software development projects by designing, developing, and testing software code.",
      "Setting an example for the team by demonstrating best practices in software development, such as writing clean, efficient, and maintainable code.",
      "Overseeing the development lifecycle of software applications, from design and development to testing and deployment.",
      "Ensure that technology solutions are scalable, reliable, and comply with regulatory requirements and internal policies.",
      "Monitor and maintain the performance and stability of software applications, identifying and resolving issues as they arise.",
      "Mentor and coach software developers to ensure that they have the skills and knowledge to develop software applications that align with business requirements and industry standards.",
      "Keeping up-to-date with the latest technologies and industry trends, and identifying opportunities for innovation and improvement",
      "Communicating with Senior management, Business stakeholders and COO's on project performance, risks, and opportunities."
    ],
    "technology": [
      ".NET Framework",
      "NET 6",
      "C#",
      "Java",
      "Spring Boot",
      "React (TypeScript)",
      "Svelte",
      "Tailwind CSS",
      "Oracle",
      "Sybase",
      "Mongo",
      "Postgres",
      "Redis",
      "OpenShift",
      "GraphQL",
      "Python"
    ],

    "techSkills": [
      {
        "icon": "logos:c-sharp",
        "name": "C#"
      },
      {
        "icon": "skill-icons:dotnet",
        "name": ".NET 6.0"
      },
      {
        "icon": "devicon:java",
        "name": "Java"
      },
      {
        "icon": "logos:spring-icon",
        "name": "SpringBoot"
      },
      {
        "icon": "skill-icons:javascript",
        "name": "JavaScript"
      },
      {
        "icon": "vscode-icons:file-type-typescript",
        "name": "TypeScript"
      },
      {
        "icon": "vscode-icons:file-type-python",
        "name": "Python"
      },
      {
        "icon": "skill-icons:react-dark",
        "name": "React"
      },
      {
        "icon": "teenyicons:nextjs-outline",
        "name": "NextJs"
      },
      {
        "icon": "vscode-icons:file-type-svelte",
        "name": "Svelte"
      },
      {
        "icon": "skill-icons:reactivex-light",
        "name": "Reactive Programming"
      },
      {
        "icon": "devicon:tailwindcss",
        "name": "Tailwind CSS"
      },
      {
        "icon": "vscode-icons:file-type-graphql",
        "name": "GraphQL"
      },
      {
        "icon": "logos:cucumber",
        "name": "Cucumber"
      },
      {
        "icon": "devicon:oracle",
        "name": "Oracle"
      },
      {
        "icon": "devicon:postgresql",
        "name": "PostgreSQL"
      },
      {
        "icon": "bi:database-add",
        "name": "Sybase"
      },
      {
        "icon": "devicon:mongodb",
        "name": "MongoDB"
      },
      {
        "icon": "devicon:redis",
        "name": "Redis"
      }
    ],
    "skills": ["Investment Banking", "Equities", "Order Management"],
    "projects": [
      {
        "name": "Lead APAC Front Office Applications | Credit Suisse",
        "description": "I currently serve as the Technical and Delivery Lead for the Front Office technology team, overseeing mission-critical applications across Order Management, Program Trading, and IOI teams. In this capacity, I am entrusted with managing and steering these vital applications to ensure their optimal performance. Collaboration is at the heart of my role. I work closely with diverse teams, including support, compliance, business, and IT, to swiftly address system issues or incidents. This cooperative approach ensures that our technology ecosystem functions seamlessly, meeting both operational and regulatory requirements. I actively participate in software development projects, where I take a hands-on approach in designing, developing, and testing software code. I prioritize scalability, reliability, and regulatory compliance in our technology solutions, emphasizing the importance of maintaining a production environment of exceptional quality. A significant part of my journey has been guiding our team through a transformative process. I introduced agile methodologies, which have enhanced our adaptability and responsiveness. We also adopted DevOps practices, streamlined our operations with the establishment of robust CI/CD pipelines, and harnessed the power of the bank's platform-as-a-service (Openshift) to efficiently develop and deploy microservices.The ongoing transformation journey not only reflects my professional growth but also symbolizes our collective pursuit of excellence in technology.",
        "technology": " C#, .Net 6, Redis, GraphQL, Mongo, Sybase, Oracle, PostgreSQL, BitBucket, Openshift, Grafana, SonarQube, Jenkins",
        "timeline": "2016 - Till date"
      },
      {
        "name": "Lead APAC Order Management Platform Migration | Credit Suisse",
        "description": "I had the privilege of spearheading the critical APAC Order Management platform migration – a multi-million-dollar project spanning several years. This endeavor marked a turning point, as we assembled a dedicated team, unified by a shared vision of transformation. Over the course of three intense years, we undertook the formidable task of transitioning from the legacy VC++ platform to a modern C#-based system. This migration presented a series of formidable challenges that tested the limits of our collective skills and determination. It was, without a doubt, the most demanding project in my career, but it was precisely this challenge that fueled our innovation and commitment.The culmination of our hard work and tenacity was the rollout of the new application, now serving over 400 users across 12 locations. This success not only represented a technological milestone but also a testament to our unwavering dedication to excellence. The project's significance resonates not just in its technical achievement but in the invaluable lessons it imparted and the bonds formed within the team. It underscored our ability to adapt, persevere, and collaborate, forging a brighter future for our organization's technological landscape.",
        "technology": " C#, Sybase, Oracle",
        "timeline": "2011 -  2014"
      },
      {
        "name": "Lead APAC Order Management System | Credit Suisse",
        "description": "I was given the responsibility to lead the mission-critical APAC order management system, which represented a pivotal moment in my career. This role allowed me to navigate a multitude of challenges and adapt to various changes effectively. I focused on increasing the application's capacity and throughput, achieving significant improvements. Over time, I successfully stabilized the product, ensuring its reliability and performance. This experience marked a transformative leap in my professional journey, enabling me to develop crucial leadership skills. It also instilled in me the ability to thrive in a dynamic and demanding environment. I take pride in the accomplishments of enhancing the system's efficiency and ensuring its mission-critical status. This role has been a valuable stepping stone, offering valuable insights and lessons for my career growth",
        "technology": " VC++, Sybase, Oracle",
        "timeline": "2006 - 2011"
      },
      {
        "name": "Electronic Market Making | Credit Suisse",
        "description": "I worked as a developer on an Electronic Market Making application, where my role involved designing and implementing innovative trading strategies to enhance the platform's capabilities.",
        "technology": " C#",
        "timeline": "2005 - 2006"
      },
      {
        "name": "Japan Margin Trading | Credit Suisse",
        "description": "Created a Equities Margin Trading System designed to facilitate trading in equities (stocks) with the use of margin, which allows traders to borrow funds to amplify their investment positions. ",
        "technology": " Java (web ui), VC++ (back-end)",
        "timeline": "2005 - 2006"
      },
      {
        "name": "Front Office Automation | Credit Suisse",
        "description": "Developing various tools for front office automation. Most important being a excel macro automation tool developed in VC++. This tool features a plugin-based architecture for parsing client order Excel files from Outlook. It offers seamless integration with Outlook, automatically extracting data from emails or attachments. The parsed data was then efficiently transferred to a Front Office System (FOS) application, streamlining the order management process. The tool's automation, pattern recognition,  data validation, and user-friendly interface contributed to improved operational efficiency and accuracy in handling client orders.This tool received praise from then APAC IT Head for its innovative approach and capabilities. ",
        "technology": " VC++, VBA, Oracle",
        "timeline": "2004-2005"
      },
      {
        "name": "Software Developer | Enventure Solution",
        "description": "Developing software in the Electronic Design Automation domain for a prestigious client called Cadence Design Systems.",
        "technology": " VC++, VBA, Oracle",
        "timeline": "2000-2004"
      }
    ],
    "personalProjects": [
      {
        "name": "portfolio",
        "link": "https://jpothanc.vercel.app/",
        "description": "Lately, I've found myself enchanted by the sleek and powerful capabilities of Svelte and Tailwind CSS. This newfound inspiration has propelled me to create a  portfolio using these cutting-edge technologies.",
        "readme": "https://api.github.com/repos/jpothanc/portfolio-go/readme",
        "repo": "https://github.com/jpothanc/portfolio-go",
        "technology": "https://skillicons.dev/icons?i=svelte,tailwind,vscode,vite,vercel&perline=5",
        "tech": ["svelte", "tailwind", "vscode", "vite", "vercel"]
      },
      {
        "name": "data store",
        "link": "https://data-store.azurewebsites.net/api/v1/data/query?catalogue=Trading&catalogueItem=Users",
        "description": "A robust read-through caching app designed to cache configured queries, accelerating performance by swiftly accessing frequently requested data.",
        "readme": "https://api.github.com/repos/jpothanc/datastore/readme",
        "repo": "https://github.com/jpothanc/datastore",
        "technology": "https://skillicons.dev/icons?i=java,spring,postgres,azure&perline=5",
        "tech": ["java", "spring", "postgres", "azure", "intellij"]
      },
      {
        "name": "hero",
        "link": "https://hero-two-gilt.vercel.app/",
        "description": "Monitoring UI for production support. Delivers real-time insights on microservices, databases. Seamlessly integrates with Java-based healthcheck service via WebSockets for instant updates.",
        "readme": "https://api.github.com/repos/jpothanc/hero/readme",
        "repo": "https://github.com/jpothanc/hero",
        "technology": "https://skillicons.dev/icons?i=react,vscode,vite,vercel&perline=10",
        "tech": ["react", "vscode", "vite", "vercel"]
      },
      {
        "name": "dynamo",
        "link": "https://dynamo-blue.vercel.app/",
        "description": "Dynamo is a web application that allows you to configure JSON endpoints and visualize the data in a grid format for easy reading and support.",
        "readme": "https://api.github.com/repos/jpothanc/dynamo/readme",
        "repo": "https://github.com/jpothanc/dynamo",
        "technology": "https://skillicons.dev/icons?i=react,vscode,vite,vercel&perline=10",
        "tech": ["react", "vscode", "vite", "vercel"]
      },
      {
        "name": "healthcheck",
        "link": "https://healthcheck-ib.azurewebsites.net/api/v1/health/check",
        "description": "Service which monitors microservices, databases with regular pings, ensuring ongoing health assessment. Offers real-time updates via WebSockets to subscribed clients. Also provides REST APIs for detailed health check info.",
        "readme": "https://api.github.com/repos/jpothanc/healthcheck/readme",
        "repo": "https://github.com/jpothanc/healthcheck",
        "technology": "https://skillicons.dev/icons?i=java,spring,postgres,azure&perline=5",
        "tech": ["java", "spring", "postgres", "azure", "intellij"]
      },

      {
        "name": "react-jp-ui",
        "link": "https://www.npmjs.com/package/react-jp-ui",
        "description": "In the world of React projects, I wanted to make my life easier by reusing components. So, I took the leap to build my own library of common React components using Vite and shared it via npm.",
        "readme": "https://api.github.com/repos/jpothanc/react-jp-ui/readme",
        "repo": "https://github.com/jpothanc/react-jp-ui",
        "technology": "https://skillicons.dev/icons?i=react,vscode,vite&perline=10",
        "tech": ["react", "vscode", "vite"]
      },
      {
        "name": "pulse",
        "link": "",
        "description": "A simple tool for testing WebSocket connections. It provides an easy-to-use interface to send and receive WebSocket messages, making it convenient for developers and testers to validate WebSocket functionality",
        "readme": "https://api.github.com/repos/jpothanc/pulse/readme",
        "repo": "https://github.com/jpothanc/pulse",
        "technology": "https://skillicons.dev/icons?i=react,vscode,vite&perline=10",
        "tech": ["react", "vscode", "vite"]
      },
      {
        "name": "equity-store",
        "link": "",
        "description": "Eager to understand the essence of Python and how it contrasts with the familiar territories of .Net and Java, I embarked on a project that would not only allow me to peek into Python but also to apply it in a real-world scenario. ",
        "readme": "https://api.github.com/repos/jpothanc/equity-store/readme",
        "repo": "https://github.com/jpothanc/equity-store/tree/main",
        "technology": "https://skillicons.dev/icons?i=python,pycharm&perline=10",
        "tech": ["python", "pycharm"]
      },
      {
        "name": "devnotes",
        "link": "https://devnotes-blond.vercel.app/",
        "description": "devnotes remember everything so you don’t have to. A simple notes look up app which can read you git markdown documents.",
        "readme": "https://api.github.com/repos/jpothanc/devnotes/readme",
        "repo": "https://github.com/jpothanc/devnotes/tree/main",
        "technology": "https://skillicons.dev/icons?i=react,vscode,vite,vercel&perline=10",
        "tech": ["react", "vscode", "vite", "vercel"]
      },
      {
        "name": "omnijp",
        "link": "https://pypi.org/project/omnijp/#description",
        "description": "OmniJP is a Python library that provides tools for common tasks in software development.It now supports features for caching database results to disk and making HTTP requests with caching support.",
        "readme": "https://api.github.com/repos/jpothanc/omnijp/readme",
        "repo": "https://github.com/jpothanc/omnijp/tree/main",
        "technology": "https://skillicons.dev/icons?i=python,pycharm&perline=10",
        "tech": ["python", "pycharm"]
      },
      {
        "name": "webq",
        "link": "https://www.nuget.org/packages/WebQ/",
        "description": "Lightweight class library aiding HTTP queries, caching results locally for resilience. Configure cached data duration, ensuring app resilience during REST endpoint downtime.",
        "readme": "https://api.github.com/repos/jpothanc/webq/readme",
        "repo": "https://github.com/jpothanc/webq",
        "technology": "https://skillicons.dev/icons?i=dotnet,visualstudio&perline=10",
        "tech": ["c#", "visualstudio"]
      },
      {
        "name": "auth me",
        "link": "",
        "description": "This .NET Standard class library which offers HTTP Basic Authentication capabilities. Features seamless integration into .NET applications, credential validation, and compatibility across various .NET projects.",
        "readme": "https://api.github.com/repos/jpothanc/authme/readme",
        "repo": "https://github.com/jpothanc/authme",
        "technology": "https://skillicons.dev/icons?i=dotnet,visualstudio&perline=10",
        "tech": ["c#", "visualstudio"]
      },
      {
        "name": "simple skin",
        "link": "https://www.nuget.org/packages/SimpleSkin",
        "description": "A lightweight class library enabling swift integration of custom skins into Windows Forms apps. Easily revamp your app's appearance without extensive control modification, offering a fresh, unique look effortlessly.",
        "readme": "https://api.github.com/repos/jpothanc/simpleskin/readme",
        "repo": "https://github.com/jpothanc/simpleskin",
        "technology": "https://skillicons.dev/icons?i=dotnet,visualstudio&perline=10",
        "tech": ["c#", "visualstudio"]
      }
    ],

    "DevelopmentPractices": [
      {
        "name": "DevOps",
        "icon": "devicon:azuredevops"
      },
      {
        "name": "Agile/SCRUM",
        "icon": "carbon:development"
      },
      {
        "name": "TDD/BDD",
        "icon": "arcticons:deep-testing"
      },
      {
        "name": "CI/CD",
        "icon": "grommet-icons:deploy"
      },
      {
        "name": "Jenkins",
        "icon": "devicon:jenkins"
      },
      {
        "name": "Git",
        "icon": "devicon:git"
      },
      {
        "name": "NUnit",
        "icon": "devicon:nunit"
      },
      {
        "name": "xUnit",
        "icon": "guidance:remove-x-cross"
      },
      {
        "name": "Specflow",
        "icon": "tabler:brand-cucumber"
      },
      {
        "name": "JUnit",
        "icon": "devicon:junit"
      },
      {
        "name": "Cucumber",
        "icon": "vscode-icons:file-type-cucumber"
      }
    ],
    "achievements": [
      {
        "name": "Investment Banking",
        "icon": "streamline:investment-selection"
      },
      {
        "name": "Equities",
        "icon": "streamline:stock-solid"
      },
      {
        "name": "Front Office Systems",
        "icon": "streamline:screen-2-solid"
      },
      {
        "name": "Consistent Top Performer",
        "icon": "eos-icons:performance"
      },
      {
        "name": "Hackathon Winner",
        "icon": "mdi:human-greeting-variant"
      }
    ],
    "articles1": [
      "React-Inversify",
      "React-Rxjs",
      "K6 Load Testing",
      "JMeter",
      "Specflow"
    ],
    "articles": [
      {
        "name": "React-Inversify",
        "description": "Dependency injection in React using inversify.",
        "icon": "devicon:react",
        "url": "https://medium.com/@kaljessy/react-dependency-injection-using-inversify-b4e1d63abc72"
      },
      {
        "name": "TailwindCSS",
        "description": "TailwindCSS: A Love story",
        "icon": "devicon:tailwindcss",
        "url": "https://medium.com/p/22681317ee84"
      },
      {
        "name": "React-Rxjs",
        "description": "How to use Reactive Extensions in React.",
        "icon": "devicon:react",
        "url": "https://medium.com/@kaljessy/react-state-management-using-rxjs-58a4d523d611"
      },
      {
        "name": "K6 Load Testing",
        "description": "Performance Testing using Grafana k6",
        "icon": "devicon:k6",
        "url": "https://dev.to/jpothanc/performance-testing-using-grafana-k6-3pg9"
      },
      {
        "name": "Publish React lib to npm",
        "description": "Publish React library to npm.",
        "icon": "devicon:react",
        "url": "https://medium.com/@kaljessy/publish-your-react-library-to-npm-using-vite-136dc81e368d"
      },
      {
        "name": "Creating and Uploading Python Libraries",
        "description": "Creating and Uploading Python Libraries",
        "icon": "devicon:python",
        "url": "https://medium.com/@kaljessy/building-and-sharing-a-guide-to-creating-and-uploading-python-libraries-56998a001a2c"
      },
      {
        "name": "Microservice in Python",
        "description": "Discovering Python Through Microservice Development",
        "icon": "devicon:python",
        "url": "https://medium.com/@kaljessy/discovering-python-through-microservice-development-cda7b8f97848"
      },
      {
        "name": "Desktop Apps using Tauri",
        "description": "Build Web Desktop Apps using Tauri.",
        "icon": "mdi:language-rust",
        "url": "https://medium.com/@kaljessy/build-web-desktop-apps-using-tauri-6fe12586016a"
      },
      {
        "name": "Desktop Apps using Electron",
        "description": "Build Web Desktop Apps using Electron.",
        "icon": "devicon:electron",
        "url": "https://medium.com/@kaljessy/build-web-desktop-apps-using-electron-a4c6e226290c"
      },
      {
        "name": "Chating with OpenAI",
        "description": "Chating with OpenAI using Python.",
        "icon": "devicon:python",
        "url": "https://medium.com/@kaljessy/chating-with-openai-using-python-3ae5a14b4501"
      },
      {
        "name": "AI Assitant using RAG",
        "description": "Personal AI Assitant using RAG and ChromaDB.",
        "icon": "devicon:python",
        "url": "https://medium.com/@kaljessy/personal-ai-assitant-using-rag-and-chromadb-6fd5c259da41"
      },
      {
        "name": "Easier and Faster Web Applications Using Svelte",
        "description": "A attempt to promote Svelte, a modern web framework.",
        "icon": "devicon:svelte",
        "url": "https://medium.com/@kaljessy/svelt-felt-better-ff7ce0f81977"
      },
      {
        "name": "Dependency Injection in Python",
        "description": "Dependency Injection in Python with injector.",
        "icon": "devicon:python",
        "url": "https://medium.com/@kaljessy/dependency-injection-in-python-with-injector-63137790c482"
      }, 
      {
        "name": "LLMS: The Essentials",
        "description": "A brief description of the LLMS.",
        "icon": "vscode-icons:file-type-ai",
        "url": "https://medium.com/@kaljessy/llms-the-essentials-3c3ae4696d81"
      }
    ],
    "git": [
      {
        "name": "Dynamo",
        "description": "Dynamic Data Binding application developed used React.",
        "url": "https://github.com/jpothanc/dynamo"
      },
      {
        "name": "AuthMe",
        "description": "Basic Authentication in your .NET applications.",
        "url": "https://github.com/jpothanc/AuthMe"
      },
      {
        "name": "WebQ",
        "description": "WebQ is a lightweight .Net class library that provides support for HTTP queries and cache results on the local disk for resiliency.",
        "url": "https://github.com/jpothanc/WebQ"
      },
      {
        "name": "Datastore",
        "description": "A configurable reference data store in Java.",
        "url": "https://github.com/jpothanc/datastore"
      },
      {
        "name": "HealthCheck",
        "description": "A configurable HealthCheck Service in Java.",
        "url": "https://github.com/jpothanc/healthcheck"
      },
      {
        "name": "Hero",
        "description": "Support dashboard for appliaction health checks.",
        "url": "https://github.com/jpothanc/hero"
      },
      {
        "name": "Pulse",
        "description": "A simple websocket testing tool.",
        "url": "https://github.com/jpothanc/pulse"
      },
      {
        "name": "Nuget Packages",
        "description": "My Nuget Packages.",
        "url": "https://www.nuget.org/profiles/jpothanc"
      }
    ],
    "git1": ["dynamo", "AuthMe", "WebQ", "datastore"],
    "personality": [
      "#pragmatic",
      "#passionate",
      "#collborative",
      "#selfless",
      "#self-driven",
      "#leader",
      "#trustworthy",
      "#empathetic",
      "#respected",
      "#adaptable"
    ]
  },
  "themes": {
    "dark1": {
      "bodyBackground": "rgb(83, 81, 81)",
      "logoBackground": "#212121",
      "logoColor": "rgba(227, 227, 227, 0.8)",
      "logoDescColor": "rgba(227, 227, 227, 0.8)",
      "mainBackground": "grey",
      "contentBackground": "white",
      "contentTextColor": "black",
      "cardTitleColor": "#1565C0",
      "careerContentBackground": "rgba(227, 227, 227, 0.8)"
    },
    "dark": {
      "primaryColor": "#4dabf5",
      "bodyBackground": "rgba(20, 20, 20,1)",
      "logoBackground": "rgba(227, 227, 227, 0.8)",
      "logoColor": "#0e0f0e",
      "logoDescColor": "#0e0e0f",
      "mainBackground": "rgb(0, 0, 0)",
      "contentBackground": "#212121",
      "contentTextColor": "#d2d5d6",
      "cardTitleColor": "rgba(255, 236, 179, 0.8)",
      "careerContentBackground": "rgba(200, 255, 400, 0.05)",
      "careerHeader": "#4dabf5",
      "careerDate": "#64FFDA",
      "aboutMenuColor": "#4dabf5",
      "barMenuColor": "#4dabf5",
      "aboutCaptionColor": "white",
      "aboutSubCaptionColor": "#039BE5",
      "badgeTechColor": "#1de9b6",
      "badgeDevPracticeColor": "#FF7043",
      "badgeSkillsColor": "#CE93D8",
      "badgePersonalityColor": "#E57373",
      "badgeLinksColor": "#4dabf5"
    }
  },
  "notes": {
    "developerName": "Jessish Pothancheri",
    "appName": "devnotes",
    "readme": "https://raw.githubusercontent.com/jpothanc/devnotes/main/README.md",
    "contentBaseUrl": "https://raw.githubusercontent.com/jpothanc/developer-notes/main/",
    "indexFile": "index/index.json",
    "defaultSelection": {
      "menu": "web",
      "bgcolor": "#00897B",
      "submenu": "web-styling/css/css_containers.md"
    }
  },

  "readme":{
    "sveltePortofilePage": "https://jpothanc.vercel.app/",
    "text":"This site was originally developed as a learning project to master React in 2023. It was initially built using React (TypeScript), Framer Motion, and Azure. As the project evolved, I discovered the elegance of Tailwind CSS, which quickly became a favorite in my toolkit. Every aspect of this site reflects my continuous learning journey. Whenever I need a creative spark or a break, I find myself returning here to tinker with new ideas.it’s something I genuinely enjoy and look forward to every time."
  }
}
