{
  "portfolio": {
    "name": "Jessish Pothancheri",
    "IntroBadge": "Development Lead | Equities Front Office|Order Management|Investment Bank",

    "intro": "Equities Front Office Solutions Technical and Delivery Lead with 20+ years of experience in designing, implementing and optimizing technology solutions for an investment bank. My expertise lies in understanding the unique challenges of the equities front office environment and delivering innovative solutions that drive revenue generation, lead high-performing teams, optimise trading processes, reduce operational risk, and improve the overall client experience",
    "experiance": [
      {
        "title": "Graduated bootcamp",
        "location": "Miami, FL",
        "description": "I graduated after 6 months of studying. I immediately found a job as a front-end developer.",
        "icon": "React.createElement(LuGraduationCap)",
        "date": "2019"
      },
      {
        "title": "Front-End Developer",
        "location": "Orlando, FL",
        "description": "I worked as a front-end developer for 2 years in 1 job and 1 year in another job. I also upskilled to the full stack.",
        "icon": "React.createElement(CgWorkAlt)",
        "date": "2019 - 2021"
      },
      {
        "title": "Full-Stack Developer",
        "location": "Houston, TX",
        "description": "I'm now a full-stack developer working as a freelancer. My stack includes React, Next.js, TypeScript, Tailwind, Prisma and MongoDB. I'm open to full-time opportunities.",
        "icon": "React.createElement(FaReact)",
        "date": "2021 - present"
      }
    ],
    "expertise": [
      " In-depth understanding of equities front office functions, including sales and trading, program trading and electronic trading.",
      "Proven ability to lead cross-functional teams and foster collaboration, innovation, and a growth mindset in fast-paced trading environments.",
      "Strong collaboration skills, with a history of successfully partnering with trading desks, operations, compliance, and technology teams.",
      "In-depth understanding of equities front office functions, including sales and trading, program trading and electronic trading.",
      "As a proactive leader, I am dedicated to fostering a positive team culture, focused on continuous improvement, innovation, and collaboration.",
      "Strong leadership and communication skills to effectively mentor and manage a team of developers, collaborate with stakeholders, and contribute to the overall success of the organization.",
      " Well-versed in design patterns, SOLID principles, and software architecture best practices to ensure maintainable and scalable code."
    ],
    "technology": [
      ".NET Framework",
      "NET 6",
      "C#",
      "Java",
      "React (TypeScript)",
      "Oracle",
      "Sybase",
      "Mongo",
      "Postgres",
      "Redis",
      "OpenShift",
      "GraphQL"
    ],
    "skills": ["Investment Banking", "Equities", "Order Management"],
    "projects": [
      {
        "name": "",
        "description": ""
      },
      {
        "name": "",
        "description": ""
      }
    ],
    "DevelopmentPractices": [
      "DevOps",
      "Agile/SCRUM",
      "TDD/BDD",
      "CI/CD",
      "NUnit",
      "xUnit",
      "Specflow"
    ],
    "achievements": [
      "Investment Banking",
      "Equities",
      "Order Management",
      "Consistent Top Performer",
      "Hackathon Winner"
    ],
    "articles": [
      "React-Inversify",
      "React-Rxjs",
      "K6 Load Testing",
      "JMeter",
      "Specflow"
    ]
  }
}
